Revit 2026 API

# DocumentGetDefaultElementTypeId Method

---

Gets the default element type id with the given DefaultElementType id.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementId GetDefaultElementTypeId(
	ElementTypeGroup defaultTypeId
)
```
```vb
Public Function GetDefaultElementTypeId (
	defaultTypeId As ElementTypeGroup
) As ElementId
```
```cpp
public:
ElementId^ GetDefaultElementTypeId(
	ElementTypeGroup defaultTypeId
)
```
```fsharp
member GetDefaultElementTypeId :
        defaultTypeId : ElementTypeGroup -> ElementId
```

#### Parameters

defaultTypeId ElementTypeGroup
     The default element type id.

#### Return Value

ElementId The element type id.

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

#### Reference

Document Class

Autodesk.Revit.DB Namespace